GopalSaraf/Practicals/PSDL/include/proc/pic18f4682.inc
// Register: B2D6
#define B2D6 B2D6
B2D6                                     equ 0E4Ch
// bitfield definitions
B2D6_B2D60_POSN                          equ 0000h
B2D6_B2D60_POSITION                      equ 0000h
B2D6_B2D60_SIZE                          equ 0001h
B2D6_B2D60_LENGTH                        equ 0001h
B2D6_B2D60_MASK                          equ 0001h
B2D6_B2D61_POSN                          equ 0001h
B2D6_B2D61_POSITION                      equ 0001h
B2D6_B2D61_SIZE                          equ 0001h
B2D6_B2D61_LENGTH                        equ 0001h
B2D6_B2D61_MASK                          equ 0002h
B2D6_B2D62_POSN                          equ 0002h
B2D6_B2D62_POSITION                      equ 0002h
B2D6_B2D62_SIZE                          equ 0001h
B2D6_B2D62_LENGTH                        equ 0001h
B2D6_B2D62_MASK                          equ 0004h
B2D6_B2D63_POSN                          equ 0003h
B2D6_B2D63_POSITION                      equ 0003h
B2D6_B2D63_SIZE                          equ 0001h
B2D6_B2D63_LENGTH                        equ 0001h
B2D6_B2D63_MASK                          equ 0008h
B2D6_B2D64_POSN                          equ 0004h
B2D6_B2D64_POSITION                      equ 0004h
B2D6_B2D64_SIZE                          equ 0001h
B2D6_B2D64_LENGTH                        equ 0001h
B2D6_B2D64_MASK                          equ 0010h
B2D6_B2D65_POSN                          equ 0005h
B2D6_B2D65_POSITION                      equ 0005h
B2D6_B2D65_SIZE                          equ 0001h
B2D6_B2D65_LENGTH                        equ 0001h
B2D6_B2D65_MASK                          equ 0020h
B2D6_B2D66_POSN                          equ 0006h
B2D6_B2D66_POSITION                      equ 0006h
B2D6_B2D66_SIZE                          equ 0001h
B2D6_B2D66_LENGTH                        equ 0001h
B2D6_B2D66_MASK                          equ 0040h
B2D6_B2D67_POSN                          equ 0007h
B2D6_B2D67_POSITION                      equ 0007h
B2D6_B2D67_SIZE                          equ 0001h
B2D6_B2D67_LENGTH                        equ 0001h
B2D6_B2D67_MASK                          equ 0080h

// Register: B2D7
#define B2D7 B2D7
B2D7                                     equ 0E4Dh
// bitfield definitions
B2D7_B2D70_POSN                          equ 0000h
B2D7_B2D70_POSITION                      equ 0000h
B2D7_B2D70_SIZE                          equ 0001h
B2D7_B2D70_LENGTH                        equ 0001h
B2D7_B2D70_MASK                          equ 0001h
B2D7_B2D71_POSN                          equ 0001h
B2D7_B2D71_POSITION                      equ 0001h
B2D7_B2D71_SIZE                          equ 0001h
B2D7_B2D71_LENGTH                        equ 0001h
B2D7_B2D71_MASK                          equ 0002h
B2D7_B2D72_POSN                          equ 0002h
B2D7_B2D72_POSITION                      equ 0002h
B2D7_B2D72_SIZE                          equ 0001h
B2D7_B2D72_LENGTH                        equ 0001h
B2D7_B2D72_MASK                          equ 0004h
B2D7_B2D73_POSN                          equ 0003h
B2D7_B2D73_POSITION                      equ 0003h
B2D7_B2D73_SIZE                          equ 0001h
B2D7_B2D73_LENGTH                        equ 0001h
B2D7_B2D73_MASK                          equ 0008h
B2D7_B2D74_POSN                          equ 0004h
B2D7_B2D74_POSITION                      equ 0004h
B2D7_B2D74_SIZE                          equ 0001h
B2D7_B2D74_LENGTH                        equ 0001h
B2D7_B2D74_MASK                          equ 0010h
B2D7_B2D75_POSN                          equ 0005h
B2D7_B2D75_POSITION                      equ 0005h
B2D7_B2D75_SIZE                          equ 0001h
B2D7_B2D75_LENGTH                        equ 0001h
B2D7_B2D75_MASK                          equ 0020h
B2D7_B2D76_POSN                          equ 0006h
B2D7_B2D76_POSITION                      equ 0006h
B2D7_B2D76_SIZE                          equ 0001h
B2D7_B2D76_LENGTH                        equ 0001h
B2D7_B2D76_MASK                          equ 0040h
B2D7_B2D77_POSN                          equ 0007h
B2D7_B2D77_POSITION                      equ 0007h
B2D7_B2D77_SIZE                          equ 0001h
B2D7_B2D77_LENGTH                        equ 0001h
B2D7_B2D77_MASK                          equ 0080h

// Register: CANSTAT_RO7
#define CANSTAT_RO7 CANSTAT_RO7
CANSTAT_RO7                              equ 0E4Eh
// bitfield definitions
CANSTAT_RO7_EICODE0_POSN                 equ 0000h
CANSTAT_RO7_EICODE0_POSITION             equ 0000h
CANSTAT_RO7_EICODE0_SIZE                 equ 0001h
CANSTAT_RO7_EICODE0_LENGTH               equ 0001h
CANSTAT_RO7_EICODE0_MASK                 equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO7_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO7_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO7_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO7_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO7_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO7_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO7_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO7_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO7_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO7_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO7_EICODE4_POSN                 equ 0004h
CANSTAT_RO7_EICODE4_POSITION             equ 0004h
CANSTAT_RO7_EICODE4_SIZE                 equ 0001h
CANSTAT_RO7_EICODE4_LENGTH               equ 0001h
CANSTAT_RO7_EICODE4_MASK                 equ 0010h
CANSTAT_RO7_OPMODE0_POSN                 equ 0005h
CANSTAT_RO7_OPMODE0_POSITION             equ 0005h
CANSTAT_RO7_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO7_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO7_OPMODE0_MASK                 equ 0020h
CANSTAT_RO7_OPMODE1_POSN                 equ 0006h
CANSTAT_RO7_OPMODE1_POSITION             equ 0006h
CANSTAT_RO7_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO7_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO7_OPMODE1_MASK                 equ 0040h
CANSTAT_RO7_OPMODE2_POSN                 equ 0007h
CANSTAT_RO7_OPMODE2_POSITION             equ 0007h
CANSTAT_RO7_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO7_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO7_OPMODE2_MASK                 equ 0080h
CANSTAT_RO7_ICODE0_POSN                  equ 0000h
CANSTAT_RO7_ICODE0_POSITION              equ 0000h
CANSTAT_RO7_ICODE0_SIZE                  equ 0001h
CANSTAT_RO7_ICODE0_LENGTH                equ 0001h
CANSTAT_RO7_ICODE0_MASK                  equ 0001h
CANSTAT_RO7_ICODE1_POSN                  equ 0001h
CANSTAT_RO7_ICODE1_POSITION              equ 0001h
CANSTAT_RO7_ICODE1_SIZE                  equ 0001h
CANSTAT_RO7_ICODE1_LENGTH                equ 0001h
CANSTAT_RO7_ICODE1_MASK                  equ 0002h
CANSTAT_RO7_ICODE2_POSN                  equ 0002h
CANSTAT_RO7_ICODE2_POSITION              equ 0002h
CANSTAT_RO7_ICODE2_SIZE                  equ 0001h
CANSTAT_RO7_ICODE2_LENGTH                equ 0001h
CANSTAT_RO7_ICODE2_MASK                  equ 0004h
CANSTAT_RO7_ICODE3_POSN                  equ 0003h
CANSTAT_RO7_ICODE3_POSITION              equ 0003h
CANSTAT_RO7_ICODE3_SIZE                  equ 0001h
CANSTAT_RO7_ICODE3_LENGTH                equ 0001h
CANSTAT_RO7_ICODE3_MASK                  equ 0008h
CANSTAT_RO7_ICODE4_POSN                  equ 0004h
CANSTAT_RO7_ICODE4_POSITION              equ 0004h
CANSTAT_RO7_ICODE4_SIZE                  equ 0001h
CANSTAT_RO7_ICODE4_LENGTH                equ 0001h
CANSTAT_RO7_ICODE4_MASK                  equ 0010h

// Register: CANCON_RO7
#define CANCON_RO7 CANCON_RO7
CANCON_RO7                               equ 0E4Fh
// bitfield definitions
CANCON_RO7_FP0_POSN                      equ 0000h
CANCON_RO7_FP0_POSITION                  equ 0000h
CANCON_RO7_FP0_SIZE                      equ 0001h
CANCON_RO7_FP0_LENGTH                    equ 0001h
CANCON_RO7_FP0_MASK                      equ 0001h
CANCON_RO7_WIN0_FP1_POSN                 equ 0001h
CANCON_RO7_WIN0_FP1_POSITION             equ 0001h
CANCON_RO7_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO7_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO7_WIN0_FP1_MASK                 equ 0002h
CANCON_RO7_WIN1_FP2_POSN                 equ 0002h
CANCON_RO7_WIN1_FP2_POSITION             equ 0002h
CANCON_RO7_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO7_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO7_WIN1_FP2_MASK                 equ 0004h
CANCON_RO7_WIN2_FP3_POSN                 equ 0003h
CANCON_RO7_WIN2_FP3_POSITION             equ 0003h
CANCON_RO7_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO7_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO7_WIN2_FP3_MASK                 equ 0008h
CANCON_RO7_ABAT_POSN                     equ 0004h
CANCON_RO7_ABAT_POSITION                 equ 0004h
CANCON_RO7_ABAT_SIZE                     equ 0001h
CANCON_RO7_ABAT_LENGTH                   equ 0001h
CANCON_RO7_ABAT_MASK                     equ 0010h
CANCON_RO7_REQOP0_POSN                   equ 0005h
CANCON_RO7_REQOP0_POSITION               equ 0005h
CANCON_RO7_REQOP0_SIZE                   equ 0001h
CANCON_RO7_REQOP0_LENGTH                 equ 0001h
CANCON_RO7_REQOP0_MASK                   equ 0020h
CANCON_RO7_REQOP1_POSN                   equ 0006h
CANCON_RO7_REQOP1_POSITION               equ 0006h
CANCON_RO7_REQOP1_SIZE                   equ 0001h
CANCON_RO7_REQOP1_LENGTH                 equ 0001h
CANCON_RO7_REQOP1_MASK                   equ 0040h
CANCON_RO7_REQOP2_POSN                   equ 0007h
CANCON_RO7_REQOP2_POSITION               equ 0007h
CANCON_RO7_REQOP2_SIZE                   equ 0001h
CANCON_RO7_REQOP2_LENGTH                 equ 0001h
CANCON_RO7_REQOP2_MASK                   equ 0080h
CANCON_RO7_WIN0_POSN                     equ 0001h
CANCON_RO7_WIN0_POSITION                 equ 0001h
CANCON_RO7_WIN0_SIZE                     equ 0001h
CANCON_RO7_WIN0_LENGTH                   equ 0001h
CANCON_RO7_WIN0_MASK                     equ 0002h
CANCON_RO7_WIN1_POSN                     equ 0002h
CANCON_RO7_WIN1_POSITION                 equ 0002h
CANCON_RO7_WIN1_SIZE                     equ 0001h
CANCON_RO7_WIN1_LENGTH                   equ 0001h
CANCON_RO7_WIN1_MASK                     equ 0004h
CANCON_RO7_WIN2_POSN                     equ 0003h
CANCON_RO7_WIN2_POSITION                 equ 0003h
CANCON_RO7_WIN2_SIZE                     equ 0001h
CANCON_RO7_WIN2_LENGTH                   equ 0001h
CANCON_RO7_WIN2_MASK                     equ 0008h

// Register: B3CON
#define B3CON B3CON
B3CON                                    equ 0E50h
// bitfield definitions
B3CON_FILHIT0_TXPRI0_POSN                equ 0000h
B3CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B3CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B3CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B3CON_FILHIT0_TXPRI0_MASK                equ 0001h
B3CON_FILHIT1_TXPRI1_POSN                equ 0001h
B3CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B3CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B3CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B3CON_FILHIT1_TXPRI1_MASK                equ 0002h
B3CON_FILHIT2_RTREN_POSN                 equ 0002h
B3CON_FILHIT2_RTREN_POSITION             equ 0002h
B3CON_FILHIT2_RTREN_SIZE                 equ 0001h
B3CON_FILHIT2_RTREN_LENGTH               equ 0001h
B3CON_FILHIT2_RTREN_MASK                 equ 0004h
B3CON_FILHIT3_TXREQ_POSN                 equ 0003h
B3CON_FILHIT3_TXREQ_POSITION             equ 0003h
B3CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B3CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B3CON_FILHIT3_TXREQ_MASK                 equ 0008h
B3CON_FILHIT4_TXERR_POSN                 equ 0004h
B3CON_FILHIT4_TXERR_POSITION             equ 0004h
B3CON_FILHIT4_TXERR_SIZE                 equ 0001h
B3CON_FILHIT4_TXERR_LENGTH               equ 0001h
B3CON_FILHIT4_TXERR_MASK                 equ 0010h
B3CON_RXRTRRO_TXLARB_POSN                equ 0005h
B3CON_RXRTRRO_TXLARB_POSITION            equ 0005h
B3CON_RXRTRRO_TXLARB_SIZE                equ 0001h
B3CON_RXRTRRO_TXLARB_LENGTH              equ 0001h
B3CON_RXRTRRO_TXLARB_MASK                equ 0020h
B3CON_RXM1_TXABT_POSN                    equ 0006h
B3CON_RXM1_TXABT_POSITION                equ 0006h
B3CON_RXM1_TXABT_SIZE                    equ 0001h
B3CON_RXM1_TXABT_LENGTH                  equ 0001h
B3CON_RXM1_TXABT_MASK                    equ 0040h
B3CON_RXFUL_TXBIF_POSN                   equ 0007h
B3CON_RXFUL_TXBIF_POSITION               equ 0007h
B3CON_RXFUL_TXBIF_SIZE                   equ 0001h
B3CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B3CON_RXFUL_TXBIF_MASK                   equ 0080h
B3CON_FILHIT0_POSN                       equ 0000h
B3CON_FILHIT0_POSITION                   equ 0000h
B3CON_FILHIT0_SIZE                       equ 0001h
B3CON_FILHIT0_LENGTH                     equ 0001h
B3CON_FILHIT0_MASK                       equ 0001h
B3CON_FILHIT1_POSN                       equ 0001h
B3CON_FILHIT1_POSITION                   equ 0001h
B3CON_FILHIT1_SIZE                       equ 0001h
B3CON_FILHIT1_LENGTH                     equ 0001h
B3CON_FILHIT1_MASK                       equ 0002h
B3CON_FILHIT2_POSN                       equ 0002h
B3CON_FILHIT2_POSITION                   equ 0002h
B3CON_FILHIT2_SIZE                       equ 0001h
B3CON_FILHIT2_LENGTH                     equ 0001h
B3CON_FILHIT2_MASK                       equ 0004h
B3CON_FILHIT3_POSN                       equ 0003h
B3CON_FILHIT3_POSITION                   equ 0003h
B3CON_FILHIT3_SIZE                       equ 0001h
B3CON_FILHIT3_LENGTH                     equ 0001h
B3CON_FILHIT3_MASK                       equ 0008h
B3CON_FILHIT4_POSN                       equ 0004h
B3CON_FILHIT4_POSITION                   equ 0004h
B3CON_FILHIT4_SIZE                       equ 0001h
B3CON_FILHIT4_LENGTH                     equ 0001h
B3CON_FILHIT4_MASK                       equ 0010h
B3CON_RTRRO_POSN                         equ 0005h
B3CON_RTRRO_POSITION                     equ 0005h
B3CON_RTRRO_SIZE                         equ 0001h
B3CON_RTRRO_LENGTH                       equ 0001h
B3CON_RTRRO_MASK                         equ 0020h
B3CON_RXM1_POSN                          equ 0006h
B3CON_RXM1_POSITION                      equ 0006h
B3CON_RXM1_SIZE                          equ 0001h
B3CON_RXM1_LENGTH                        equ 0001h
B3CON_RXM1_MASK                          equ 0040h
B3CON_RXFUL_POSN                         equ 0007h
B3CON_RXFUL_POSITION                     equ 0007h
B3CON_RXFUL_SIZE                         equ 0001h
B3CON_RXFUL_LENGTH                       equ 0001h
B3CON_RXFUL_MASK                         equ 0080h
B3CON_TXPRI0_POSN                        equ 0000h
B3CON_TXPRI0_POSITION                    equ 0000h
B3CON_TXPRI0_SIZE                        equ 0001h
B3CON_TXPRI0_LENGTH                      equ 0001h
B3CON_TXPRI0_MASK                        equ 0001h
B3CON_TXPRI1_POSN                        equ 0001h
B3CON_TXPRI1_POSITION                    equ 0001h
B3CON_TXPRI1_SIZE                        equ 0001h
B3CON_TXPRI1_LENGTH                      equ 0001h
B3CON_TXPRI1_MASK                        equ 0002h
B3CON_RTREN_POSN                         equ 0002h
B3CON_RTREN_POSITION                     equ 0002h
B3CON_RTREN_SIZE                         equ 0001h
B3CON_RTREN_LENGTH                       equ 0001h
B3CON_RTREN_MASK                         equ 0004h
B3CON_TXREQ_POSN                         equ 0003h
B3CON_TXREQ_POSITION                     equ 0003h
B3CON_TXREQ_SIZE                         equ 0001h
B3CON_TXREQ_LENGTH                       equ 0001h
B3CON_TXREQ_MASK                         equ 0008h
B3CON_TXERR_POSN                         equ 0004h
B3CON_TXERR_POSITION                     equ 0004h
B3CON_TXERR_SIZE                         equ 0001h
B3CON_TXERR_LENGTH                       equ 0001h
B3CON_TXERR_MASK                         equ 0010h
B3CON_TXLARB_POSN                        equ 0005h
B3CON_TXLARB_POSITION                    equ 0005h
B3CON_TXLARB_SIZE                        equ 0001h
B3CON_TXLARB_LENGTH                      equ 0001h
B3CON_TXLARB_MASK                        equ 0020h
B3CON_TXABT_POSN                         equ 0006h
B3CON_TXABT_POSITION                     equ 0006h
B3CON_TXABT_SIZE                         equ 0001h
B3CON_TXABT_LENGTH                       equ 0001h
B3CON_TXABT_MASK                         equ 0040h
B3CON_TXBIF_POSN                         equ 0007h
B3CON_TXBIF_POSITION                     equ 0007h
B3CON_TXBIF_SIZE                         equ 0001h
B3CON_TXBIF_LENGTH                       equ 0001h
B3CON_TXBIF_MASK                         equ 0080h
B3CON_RXRTRRO_POSN                       equ 0005h
B3CON_RXRTRRO_POSITION                   equ 0005h
B3CON_RXRTRRO_SIZE                       equ 0001h
B3CON_RXRTRRO_LENGTH                     equ 0001h
B3CON_RXRTRRO_MASK                       equ 0020h
B3CON_B3FILHIT0_POSN                     equ 0000h
B3CON_B3FILHIT0_POSITION                 equ 0000h
B3CON_B3FILHIT0_SIZE                     equ 0001h
B3CON_B3FILHIT0_LENGTH                   equ 0001h
B3CON_B3FILHIT0_MASK                     equ 0001h
B3CON_B3FILHIT1_POSN                     equ 0001h
B3CON_B3FILHIT1_POSITION                 equ 0001h
B3CON_B3FILHIT1_SIZE                     equ 0001h
B3CON_B3FILHIT1_LENGTH                   equ 0001h
B3CON_B3FILHIT1_MASK                     equ 0002h
B3CON_B3FILHIT2_POSN                     equ 0002h
B3CON_B3FILHIT2_POSITION                 equ 0002h
B3CON_B3FILHIT2_SIZE                     equ 0001h
B3CON_B3FILHIT2_LENGTH                   equ 0001h
B3CON_B3FILHIT2_MASK                     equ 0004h
B3CON_B3FILHIT3_POSN                     equ 0003h
B3CON_B3FILHIT3_POSITION                 equ 0003h
B3CON_B3FILHIT3_SIZE                     equ 0001h
B3CON_B3FILHIT3_LENGTH                   equ 0001h
B3CON_B3FILHIT3_MASK                     equ 0008h
B3CON_B3FILHIT4_POSN                     equ 0004h
B3CON_B3FILHIT4_POSITION                 equ 0004h
B3CON_B3FILHIT4_SIZE                     equ 0001h
B3CON_B3FILHIT4_LENGTH                   equ 0001h
B3CON_B3FILHIT4_MASK                     equ 0010h
B3CON_B3RTRRO_POSN                       equ 0005h
B3CON_B3RTRRO_POSITION                   equ 0005h
B3CON_B3RTRRO_SIZE                       equ 0001h
B3CON_B3RTRRO_LENGTH                     equ 0001h
B3CON_B3RTRRO_MASK                       equ 0020h
B3CON_B3RXM1_POSN                        equ 0006h
B3CON_B3RXM1_POSITION                    equ 0006h
B3CON_B3RXM1_SIZE                        equ 0001h
B3CON_B3RXM1_LENGTH                      equ 0001h
B3CON_B3RXM1_MASK                        equ 0040h
B3CON_B3RXFUL_POSN                       equ 0007h
B3CON_B3RXFUL_POSITION                   equ 0007h
B3CON_B3RXFUL_SIZE                       equ 0001h
B3CON_B3RXFUL_LENGTH                     equ 0001h
B3CON_B3RXFUL_MASK                       equ 0080h
B3CON_B3TXPRI0_POSN                      equ 0000h
B3CON_B3TXPRI0_POSITION                  equ 0000h
B3CON_B3TXPRI0_SIZE                      equ 0001h
B3CON_B3TXPRI0_LENGTH                    equ 0001h
B3CON_B3TXPRI0_MASK                      equ 0001h
B3CON_B3TXPRI1_POSN                      equ 0001h
B3CON_B3TXPRI1_POSITION                  equ 0001h
B3CON_B3TXPRI1_SIZE                      equ 0001h
B3CON_B3TXPRI1_LENGTH                    equ 0001h
B3CON_B3TXPRI1_MASK                      equ 0002h
B3CON_B3RTREN_POSN                       equ 0002h
B3CON_B3RTREN_POSITION                   equ 0002h
B3CON_B3RTREN_SIZE                       equ 0001h
B3CON_B3RTREN_LENGTH                     equ 0001h
B3CON_B3RTREN_MASK                       equ 0004h
B3CON_B3TXREQ_POSN                       equ 0003h
B3CON_B3TXREQ_POSITION                   equ 0003h
B3CON_B3TXREQ_SIZE                       equ 0001h
B3CON_B3TXREQ_LENGTH                     equ 0001h
B3CON_B3TXREQ_MASK                       equ 0008h
B3CON_B3TXERR_POSN                       equ 0004h
B3CON_B3TXERR_POSITION                   equ 0004h
B3CON_B3TXERR_SIZE                       equ 0001h
B3CON_B3TXERR_LENGTH                     equ 0001h
B3CON_B3TXERR_MASK                       equ 0010h
B3CON_B3TXLARB_POSN                      equ 0005h
B3CON_B3TXLARB_POSITION                  equ 0005h
B3CON_B3TXLARB_SIZE                      equ 0001h
B3CON_B3TXLARB_LENGTH                    equ 0001h
B3CON_B3TXLARB_MASK                      equ 0020h
B3CON_B3TXABT_POSN                       equ 0006h
B3CON_B3TXABT_POSITION                   equ 0006h
B3CON_B3TXABT_SIZE                       equ 0001h
B3CON_B3TXABT_LENGTH                     equ 0001h
B3CON_B3TXABT_MASK                       equ 0040h
B3CON_B3TXB3IF_POSN                      equ 0007h
B3CON_B3TXB3IF_POSITION                  equ 0007h
B3CON_B3TXB3IF_SIZE                      equ 0001h
B3CON_B3TXB3IF_LENGTH                    equ 0001h
B3CON_B3TXB3IF_MASK                      equ 0080h

