GopalSaraf/Practicals/PSDL/include/proc/pic18f4682.inc
// Register: B5SIDL
#define B5SIDL B5SIDL
B5SIDL                                   equ 0E72h
// bitfield definitions
B5SIDL_EID16_POSN                        equ 0000h
B5SIDL_EID16_POSITION                    equ 0000h
B5SIDL_EID16_SIZE                        equ 0001h
B5SIDL_EID16_LENGTH                      equ 0001h
B5SIDL_EID16_MASK                        equ 0001h
B5SIDL_EID17_POSN                        equ 0001h
B5SIDL_EID17_POSITION                    equ 0001h
B5SIDL_EID17_SIZE                        equ 0001h
B5SIDL_EID17_LENGTH                      equ 0001h
B5SIDL_EID17_MASK                        equ 0002h
B5SIDL_EXIDE_POSN                        equ 0003h
B5SIDL_EXIDE_POSITION                    equ 0003h
B5SIDL_EXIDE_SIZE                        equ 0001h
B5SIDL_EXIDE_LENGTH                      equ 0001h
B5SIDL_EXIDE_MASK                        equ 0008h
B5SIDL_SRR_POSN                          equ 0004h
B5SIDL_SRR_POSITION                      equ 0004h
B5SIDL_SRR_SIZE                          equ 0001h
B5SIDL_SRR_LENGTH                        equ 0001h
B5SIDL_SRR_MASK                          equ 0010h
B5SIDL_SID0_POSN                         equ 0005h
B5SIDL_SID0_POSITION                     equ 0005h
B5SIDL_SID0_SIZE                         equ 0001h
B5SIDL_SID0_LENGTH                       equ 0001h
B5SIDL_SID0_MASK                         equ 0020h
B5SIDL_SID1_POSN                         equ 0006h
B5SIDL_SID1_POSITION                     equ 0006h
B5SIDL_SID1_SIZE                         equ 0001h
B5SIDL_SID1_LENGTH                       equ 0001h
B5SIDL_SID1_MASK                         equ 0040h
B5SIDL_SID2_POSN                         equ 0007h
B5SIDL_SID2_POSITION                     equ 0007h
B5SIDL_SID2_SIZE                         equ 0001h
B5SIDL_SID2_LENGTH                       equ 0001h
B5SIDL_SID2_MASK                         equ 0080h
B5SIDL_EXID_POSN                         equ 0003h
B5SIDL_EXID_POSITION                     equ 0003h
B5SIDL_EXID_SIZE                         equ 0001h
B5SIDL_EXID_LENGTH                       equ 0001h
B5SIDL_EXID_MASK                         equ 0008h
B5SIDL_EXIDEN_POSN                       equ 0003h
B5SIDL_EXIDEN_POSITION                   equ 0003h
B5SIDL_EXIDEN_SIZE                       equ 0001h
B5SIDL_EXIDEN_LENGTH                     equ 0001h
B5SIDL_EXIDEN_MASK                       equ 0008h
B5SIDL_B5EID16_POSN                      equ 0000h
B5SIDL_B5EID16_POSITION                  equ 0000h
B5SIDL_B5EID16_SIZE                      equ 0001h
B5SIDL_B5EID16_LENGTH                    equ 0001h
B5SIDL_B5EID16_MASK                      equ 0001h
B5SIDL_B5EID17_POSN                      equ 0001h
B5SIDL_B5EID17_POSITION                  equ 0001h
B5SIDL_B5EID17_SIZE                      equ 0001h
B5SIDL_B5EID17_LENGTH                    equ 0001h
B5SIDL_B5EID17_MASK                      equ 0002h
B5SIDL_B5EXID_POSN                       equ 0003h
B5SIDL_B5EXID_POSITION                   equ 0003h
B5SIDL_B5EXID_SIZE                       equ 0001h
B5SIDL_B5EXID_LENGTH                     equ 0001h
B5SIDL_B5EXID_MASK                       equ 0008h
B5SIDL_B5SRR_POSN                        equ 0004h
B5SIDL_B5SRR_POSITION                    equ 0004h
B5SIDL_B5SRR_SIZE                        equ 0001h
B5SIDL_B5SRR_LENGTH                      equ 0001h
B5SIDL_B5SRR_MASK                        equ 0010h
B5SIDL_B5SID0_POSN                       equ 0005h
B5SIDL_B5SID0_POSITION                   equ 0005h
B5SIDL_B5SID0_SIZE                       equ 0001h
B5SIDL_B5SID0_LENGTH                     equ 0001h
B5SIDL_B5SID0_MASK                       equ 0020h
B5SIDL_B5SID1_POSN                       equ 0006h
B5SIDL_B5SID1_POSITION                   equ 0006h
B5SIDL_B5SID1_SIZE                       equ 0001h
B5SIDL_B5SID1_LENGTH                     equ 0001h
B5SIDL_B5SID1_MASK                       equ 0040h
B5SIDL_B5SID2_POSN                       equ 0007h
B5SIDL_B5SID2_POSITION                   equ 0007h
B5SIDL_B5SID2_SIZE                       equ 0001h
B5SIDL_B5SID2_LENGTH                     equ 0001h
B5SIDL_B5SID2_MASK                       equ 0080h
B5SIDL_B5EXIDE_POSN                      equ 0003h
B5SIDL_B5EXIDE_POSITION                  equ 0003h
B5SIDL_B5EXIDE_SIZE                      equ 0001h
B5SIDL_B5EXIDE_LENGTH                    equ 0001h
B5SIDL_B5EXIDE_MASK                      equ 0008h

// Register: B5EIDH
#define B5EIDH B5EIDH
B5EIDH                                   equ 0E73h
// bitfield definitions
B5EIDH_EID8_POSN                         equ 0000h
B5EIDH_EID8_POSITION                     equ 0000h
B5EIDH_EID8_SIZE                         equ 0001h
B5EIDH_EID8_LENGTH                       equ 0001h
B5EIDH_EID8_MASK                         equ 0001h
B5EIDH_EID9_POSN                         equ 0001h
B5EIDH_EID9_POSITION                     equ 0001h
B5EIDH_EID9_SIZE                         equ 0001h
B5EIDH_EID9_LENGTH                       equ 0001h
B5EIDH_EID9_MASK                         equ 0002h
B5EIDH_EID10_POSN                        equ 0002h
B5EIDH_EID10_POSITION                    equ 0002h
B5EIDH_EID10_SIZE                        equ 0001h
B5EIDH_EID10_LENGTH                      equ 0001h
B5EIDH_EID10_MASK                        equ 0004h
B5EIDH_EID11_POSN                        equ 0003h
B5EIDH_EID11_POSITION                    equ 0003h
B5EIDH_EID11_SIZE                        equ 0001h
B5EIDH_EID11_LENGTH                      equ 0001h
B5EIDH_EID11_MASK                        equ 0008h
B5EIDH_EID12_POSN                        equ 0004h
B5EIDH_EID12_POSITION                    equ 0004h
B5EIDH_EID12_SIZE                        equ 0001h
B5EIDH_EID12_LENGTH                      equ 0001h
B5EIDH_EID12_MASK                        equ 0010h
B5EIDH_EID13_POSN                        equ 0005h
B5EIDH_EID13_POSITION                    equ 0005h
B5EIDH_EID13_SIZE                        equ 0001h
B5EIDH_EID13_LENGTH                      equ 0001h
B5EIDH_EID13_MASK                        equ 0020h
B5EIDH_EID14_POSN                        equ 0006h
B5EIDH_EID14_POSITION                    equ 0006h
B5EIDH_EID14_SIZE                        equ 0001h
B5EIDH_EID14_LENGTH                      equ 0001h
B5EIDH_EID14_MASK                        equ 0040h
B5EIDH_EID15_POSN                        equ 0007h
B5EIDH_EID15_POSITION                    equ 0007h
B5EIDH_EID15_SIZE                        equ 0001h
B5EIDH_EID15_LENGTH                      equ 0001h
B5EIDH_EID15_MASK                        equ 0080h
B5EIDH_B5EID8_POSN                       equ 0000h
B5EIDH_B5EID8_POSITION                   equ 0000h
B5EIDH_B5EID8_SIZE                       equ 0001h
B5EIDH_B5EID8_LENGTH                     equ 0001h
B5EIDH_B5EID8_MASK                       equ 0001h
B5EIDH_B5EID9_POSN                       equ 0001h
B5EIDH_B5EID9_POSITION                   equ 0001h
B5EIDH_B5EID9_SIZE                       equ 0001h
B5EIDH_B5EID9_LENGTH                     equ 0001h
B5EIDH_B5EID9_MASK                       equ 0002h
B5EIDH_B5EID10_POSN                      equ 0002h
B5EIDH_B5EID10_POSITION                  equ 0002h
B5EIDH_B5EID10_SIZE                      equ 0001h
B5EIDH_B5EID10_LENGTH                    equ 0001h
B5EIDH_B5EID10_MASK                      equ 0004h
B5EIDH_B5EID11_POSN                      equ 0003h
B5EIDH_B5EID11_POSITION                  equ 0003h
B5EIDH_B5EID11_SIZE                      equ 0001h
B5EIDH_B5EID11_LENGTH                    equ 0001h
B5EIDH_B5EID11_MASK                      equ 0008h
B5EIDH_B5EID12_POSN                      equ 0004h
B5EIDH_B5EID12_POSITION                  equ 0004h
B5EIDH_B5EID12_SIZE                      equ 0001h
B5EIDH_B5EID12_LENGTH                    equ 0001h
B5EIDH_B5EID12_MASK                      equ 0010h
B5EIDH_B5EID13_POSN                      equ 0005h
B5EIDH_B5EID13_POSITION                  equ 0005h
B5EIDH_B5EID13_SIZE                      equ 0001h
B5EIDH_B5EID13_LENGTH                    equ 0001h
B5EIDH_B5EID13_MASK                      equ 0020h
B5EIDH_B5EID14_POSN                      equ 0006h
B5EIDH_B5EID14_POSITION                  equ 0006h
B5EIDH_B5EID14_SIZE                      equ 0001h
B5EIDH_B5EID14_LENGTH                    equ 0001h
B5EIDH_B5EID14_MASK                      equ 0040h
B5EIDH_B5EID15_POSN                      equ 0007h
B5EIDH_B5EID15_POSITION                  equ 0007h
B5EIDH_B5EID15_SIZE                      equ 0001h
B5EIDH_B5EID15_LENGTH                    equ 0001h
B5EIDH_B5EID15_MASK                      equ 0080h

// Register: B5EIDL
#define B5EIDL B5EIDL
B5EIDL                                   equ 0E74h
// bitfield definitions
B5EIDL_EID0_POSN                         equ 0000h
B5EIDL_EID0_POSITION                     equ 0000h
B5EIDL_EID0_SIZE                         equ 0001h
B5EIDL_EID0_LENGTH                       equ 0001h
B5EIDL_EID0_MASK                         equ 0001h
B5EIDL_EID1_POSN                         equ 0001h
B5EIDL_EID1_POSITION                     equ 0001h
B5EIDL_EID1_SIZE                         equ 0001h
B5EIDL_EID1_LENGTH                       equ 0001h
B5EIDL_EID1_MASK                         equ 0002h
B5EIDL_EID2_POSN                         equ 0002h
B5EIDL_EID2_POSITION                     equ 0002h
B5EIDL_EID2_SIZE                         equ 0001h
B5EIDL_EID2_LENGTH                       equ 0001h
B5EIDL_EID2_MASK                         equ 0004h
B5EIDL_EID3_POSN                         equ 0003h
B5EIDL_EID3_POSITION                     equ 0003h
B5EIDL_EID3_SIZE                         equ 0001h
B5EIDL_EID3_LENGTH                       equ 0001h
B5EIDL_EID3_MASK                         equ 0008h
B5EIDL_EID4_POSN                         equ 0004h
B5EIDL_EID4_POSITION                     equ 0004h
B5EIDL_EID4_SIZE                         equ 0001h
B5EIDL_EID4_LENGTH                       equ 0001h
B5EIDL_EID4_MASK                         equ 0010h
B5EIDL_EID5_POSN                         equ 0005h
B5EIDL_EID5_POSITION                     equ 0005h
B5EIDL_EID5_SIZE                         equ 0001h
B5EIDL_EID5_LENGTH                       equ 0001h
B5EIDL_EID5_MASK                         equ 0020h
B5EIDL_EID6_POSN                         equ 0006h
B5EIDL_EID6_POSITION                     equ 0006h
B5EIDL_EID6_SIZE                         equ 0001h
B5EIDL_EID6_LENGTH                       equ 0001h
B5EIDL_EID6_MASK                         equ 0040h
B5EIDL_EID7_POSN                         equ 0007h
B5EIDL_EID7_POSITION                     equ 0007h
B5EIDL_EID7_SIZE                         equ 0001h
B5EIDL_EID7_LENGTH                       equ 0001h
B5EIDL_EID7_MASK                         equ 0080h
B5EIDL_B5EID0_POSN                       equ 0000h
B5EIDL_B5EID0_POSITION                   equ 0000h
B5EIDL_B5EID0_SIZE                       equ 0001h
B5EIDL_B5EID0_LENGTH                     equ 0001h
B5EIDL_B5EID0_MASK                       equ 0001h
B5EIDL_B5EID1_POSN                       equ 0001h
B5EIDL_B5EID1_POSITION                   equ 0001h
B5EIDL_B5EID1_SIZE                       equ 0001h
B5EIDL_B5EID1_LENGTH                     equ 0001h
B5EIDL_B5EID1_MASK                       equ 0002h
B5EIDL_B5EID2_POSN                       equ 0002h
B5EIDL_B5EID2_POSITION                   equ 0002h
B5EIDL_B5EID2_SIZE                       equ 0001h
B5EIDL_B5EID2_LENGTH                     equ 0001h
B5EIDL_B5EID2_MASK                       equ 0004h
B5EIDL_B5EID3_POSN                       equ 0003h
B5EIDL_B5EID3_POSITION                   equ 0003h
B5EIDL_B5EID3_SIZE                       equ 0001h
B5EIDL_B5EID3_LENGTH                     equ 0001h
B5EIDL_B5EID3_MASK                       equ 0008h
B5EIDL_B5EID4_POSN                       equ 0004h
B5EIDL_B5EID4_POSITION                   equ 0004h
B5EIDL_B5EID4_SIZE                       equ 0001h
B5EIDL_B5EID4_LENGTH                     equ 0001h
B5EIDL_B5EID4_MASK                       equ 0010h
B5EIDL_B5EID5_POSN                       equ 0005h
B5EIDL_B5EID5_POSITION                   equ 0005h
B5EIDL_B5EID5_SIZE                       equ 0001h
B5EIDL_B5EID5_LENGTH                     equ 0001h
B5EIDL_B5EID5_MASK                       equ 0020h
B5EIDL_B5EID6_POSN                       equ 0006h
B5EIDL_B5EID6_POSITION                   equ 0006h
B5EIDL_B5EID6_SIZE                       equ 0001h
B5EIDL_B5EID6_LENGTH                     equ 0001h
B5EIDL_B5EID6_MASK                       equ 0040h
B5EIDL_B5EID7_POSN                       equ 0007h
B5EIDL_B5EID7_POSITION                   equ 0007h
B5EIDL_B5EID7_SIZE                       equ 0001h
B5EIDL_B5EID7_LENGTH                     equ 0001h
B5EIDL_B5EID7_MASK                       equ 0080h

// Register: B5DLC
#define B5DLC B5DLC
B5DLC                                    equ 0E75h
// bitfield definitions
B5DLC_DLC0_POSN                          equ 0000h
B5DLC_DLC0_POSITION                      equ 0000h
B5DLC_DLC0_SIZE                          equ 0001h
B5DLC_DLC0_LENGTH                        equ 0001h
B5DLC_DLC0_MASK                          equ 0001h
B5DLC_DLC1_POSN                          equ 0001h
B5DLC_DLC1_POSITION                      equ 0001h
B5DLC_DLC1_SIZE                          equ 0001h
B5DLC_DLC1_LENGTH                        equ 0001h
B5DLC_DLC1_MASK                          equ 0002h
B5DLC_DLC2_POSN                          equ 0002h
B5DLC_DLC2_POSITION                      equ 0002h
B5DLC_DLC2_SIZE                          equ 0001h
B5DLC_DLC2_LENGTH                        equ 0001h
B5DLC_DLC2_MASK                          equ 0004h
B5DLC_DLC3_POSN                          equ 0003h
B5DLC_DLC3_POSITION                      equ 0003h
B5DLC_DLC3_SIZE                          equ 0001h
B5DLC_DLC3_LENGTH                        equ 0001h
B5DLC_DLC3_MASK                          equ 0008h
B5DLC_RB0_POSN                           equ 0004h
B5DLC_RB0_POSITION                       equ 0004h
B5DLC_RB0_SIZE                           equ 0001h
B5DLC_RB0_LENGTH                         equ 0001h
B5DLC_RB0_MASK                           equ 0010h
B5DLC_RB1_POSN                           equ 0005h
B5DLC_RB1_POSITION                       equ 0005h
B5DLC_RB1_SIZE                           equ 0001h
B5DLC_RB1_LENGTH                         equ 0001h
B5DLC_RB1_MASK                           equ 0020h
B5DLC_RXRTR_TXRTR_POSN                   equ 0006h
B5DLC_RXRTR_TXRTR_POSITION               equ 0006h
B5DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B5DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B5DLC_RXRTR_TXRTR_MASK                   equ 0040h
B5DLC_RESRB0_POSN                        equ 0004h
B5DLC_RESRB0_POSITION                    equ 0004h
B5DLC_RESRB0_SIZE                        equ 0001h
B5DLC_RESRB0_LENGTH                      equ 0001h
B5DLC_RESRB0_MASK                        equ 0010h
B5DLC_RESRB1_POSN                        equ 0005h
B5DLC_RESRB1_POSITION                    equ 0005h
B5DLC_RESRB1_SIZE                        equ 0001h
B5DLC_RESRB1_LENGTH                      equ 0001h
B5DLC_RESRB1_MASK                        equ 0020h
B5DLC_RXRTR_POSN                         equ 0006h
B5DLC_RXRTR_POSITION                     equ 0006h
B5DLC_RXRTR_SIZE                         equ 0001h
B5DLC_RXRTR_LENGTH                       equ 0001h
B5DLC_RXRTR_MASK                         equ 0040h
B5DLC_B5DLC0_POSN                        equ 0000h
B5DLC_B5DLC0_POSITION                    equ 0000h
B5DLC_B5DLC0_SIZE                        equ 0001h
B5DLC_B5DLC0_LENGTH                      equ 0001h
B5DLC_B5DLC0_MASK                        equ 0001h
B5DLC_B5DLC1_POSN                        equ 0001h
B5DLC_B5DLC1_POSITION                    equ 0001h
B5DLC_B5DLC1_SIZE                        equ 0001h
B5DLC_B5DLC1_LENGTH                      equ 0001h
B5DLC_B5DLC1_MASK                        equ 0002h
B5DLC_B5DLC2_POSN                        equ 0002h
B5DLC_B5DLC2_POSITION                    equ 0002h
B5DLC_B5DLC2_SIZE                        equ 0001h
B5DLC_B5DLC2_LENGTH                      equ 0001h
B5DLC_B5DLC2_MASK                        equ 0004h
B5DLC_B5DLC3_POSN                        equ 0003h
B5DLC_B5DLC3_POSITION                    equ 0003h
B5DLC_B5DLC3_SIZE                        equ 0001h
B5DLC_B5DLC3_LENGTH                      equ 0001h
B5DLC_B5DLC3_MASK                        equ 0008h
B5DLC_B5RB0_POSN                         equ 0004h
B5DLC_B5RB0_POSITION                     equ 0004h
B5DLC_B5RB0_SIZE                         equ 0001h
B5DLC_B5RB0_LENGTH                       equ 0001h
B5DLC_B5RB0_MASK                         equ 0010h
B5DLC_B5RB1_POSN                         equ 0005h
B5DLC_B5RB1_POSITION                     equ 0005h
B5DLC_B5RB1_SIZE                         equ 0001h
B5DLC_B5RB1_LENGTH                       equ 0001h
B5DLC_B5RB1_MASK                         equ 0020h
B5DLC_B5RXRTR_POSN                       equ 0006h
B5DLC_B5RXRTR_POSITION                   equ 0006h
B5DLC_B5RXRTR_SIZE                       equ 0001h
B5DLC_B5RXRTR_LENGTH                     equ 0001h
B5DLC_B5RXRTR_MASK                       equ 0040h

