GopalSaraf/Practicals/PSDL/include/proc/pic18f4682.inc
// Register: TXB1D4
#define TXB1D4 TXB1D4
TXB1D4                                   equ 0F3Ah
// bitfield definitions
TXB1D4_TXB1D40_POSN                      equ 0000h
TXB1D4_TXB1D40_POSITION                  equ 0000h
TXB1D4_TXB1D40_SIZE                      equ 0001h
TXB1D4_TXB1D40_LENGTH                    equ 0001h
TXB1D4_TXB1D40_MASK                      equ 0001h
TXB1D4_TXB1D41_POSN                      equ 0001h
TXB1D4_TXB1D41_POSITION                  equ 0001h
TXB1D4_TXB1D41_SIZE                      equ 0001h
TXB1D4_TXB1D41_LENGTH                    equ 0001h
TXB1D4_TXB1D41_MASK                      equ 0002h
TXB1D4_TXB1D42_POSN                      equ 0002h
TXB1D4_TXB1D42_POSITION                  equ 0002h
TXB1D4_TXB1D42_SIZE                      equ 0001h
TXB1D4_TXB1D42_LENGTH                    equ 0001h
TXB1D4_TXB1D42_MASK                      equ 0004h
TXB1D4_TXB1D43_POSN                      equ 0003h
TXB1D4_TXB1D43_POSITION                  equ 0003h
TXB1D4_TXB1D43_SIZE                      equ 0001h
TXB1D4_TXB1D43_LENGTH                    equ 0001h
TXB1D4_TXB1D43_MASK                      equ 0008h
TXB1D4_TXB1D44_POSN                      equ 0004h
TXB1D4_TXB1D44_POSITION                  equ 0004h
TXB1D4_TXB1D44_SIZE                      equ 0001h
TXB1D4_TXB1D44_LENGTH                    equ 0001h
TXB1D4_TXB1D44_MASK                      equ 0010h
TXB1D4_TXB1D45_POSN                      equ 0005h
TXB1D4_TXB1D45_POSITION                  equ 0005h
TXB1D4_TXB1D45_SIZE                      equ 0001h
TXB1D4_TXB1D45_LENGTH                    equ 0001h
TXB1D4_TXB1D45_MASK                      equ 0020h
TXB1D4_TXB1D46_POSN                      equ 0006h
TXB1D4_TXB1D46_POSITION                  equ 0006h
TXB1D4_TXB1D46_SIZE                      equ 0001h
TXB1D4_TXB1D46_LENGTH                    equ 0001h
TXB1D4_TXB1D46_MASK                      equ 0040h
TXB1D4_TXB1D47_POSN                      equ 0007h
TXB1D4_TXB1D47_POSITION                  equ 0007h
TXB1D4_TXB1D47_SIZE                      equ 0001h
TXB1D4_TXB1D47_LENGTH                    equ 0001h
TXB1D4_TXB1D47_MASK                      equ 0080h

// Register: TXB1D5
#define TXB1D5 TXB1D5
TXB1D5                                   equ 0F3Bh
// bitfield definitions
TXB1D5_TXB1D50_POSN                      equ 0000h
TXB1D5_TXB1D50_POSITION                  equ 0000h
TXB1D5_TXB1D50_SIZE                      equ 0001h
TXB1D5_TXB1D50_LENGTH                    equ 0001h
TXB1D5_TXB1D50_MASK                      equ 0001h
TXB1D5_TXB1D51_POSN                      equ 0001h
TXB1D5_TXB1D51_POSITION                  equ 0001h
TXB1D5_TXB1D51_SIZE                      equ 0001h
TXB1D5_TXB1D51_LENGTH                    equ 0001h
TXB1D5_TXB1D51_MASK                      equ 0002h
TXB1D5_TXB1D52_POSN                      equ 0002h
TXB1D5_TXB1D52_POSITION                  equ 0002h
TXB1D5_TXB1D52_SIZE                      equ 0001h
TXB1D5_TXB1D52_LENGTH                    equ 0001h
TXB1D5_TXB1D52_MASK                      equ 0004h
TXB1D5_TXB1D53_POSN                      equ 0003h
TXB1D5_TXB1D53_POSITION                  equ 0003h
TXB1D5_TXB1D53_SIZE                      equ 0001h
TXB1D5_TXB1D53_LENGTH                    equ 0001h
TXB1D5_TXB1D53_MASK                      equ 0008h
TXB1D5_TXB1D54_POSN                      equ 0004h
TXB1D5_TXB1D54_POSITION                  equ 0004h
TXB1D5_TXB1D54_SIZE                      equ 0001h
TXB1D5_TXB1D54_LENGTH                    equ 0001h
TXB1D5_TXB1D54_MASK                      equ 0010h
TXB1D5_TXB1D55_POSN                      equ 0005h
TXB1D5_TXB1D55_POSITION                  equ 0005h
TXB1D5_TXB1D55_SIZE                      equ 0001h
TXB1D5_TXB1D55_LENGTH                    equ 0001h
TXB1D5_TXB1D55_MASK                      equ 0020h
TXB1D5_TXB1D56_POSN                      equ 0006h
TXB1D5_TXB1D56_POSITION                  equ 0006h
TXB1D5_TXB1D56_SIZE                      equ 0001h
TXB1D5_TXB1D56_LENGTH                    equ 0001h
TXB1D5_TXB1D56_MASK                      equ 0040h
TXB1D5_TXB1D57_POSN                      equ 0007h
TXB1D5_TXB1D57_POSITION                  equ 0007h
TXB1D5_TXB1D57_SIZE                      equ 0001h
TXB1D5_TXB1D57_LENGTH                    equ 0001h
TXB1D5_TXB1D57_MASK                      equ 0080h

// Register: TXB1D6
#define TXB1D6 TXB1D6
TXB1D6                                   equ 0F3Ch
// bitfield definitions
TXB1D6_TXB1D60_POSN                      equ 0000h
TXB1D6_TXB1D60_POSITION                  equ 0000h
TXB1D6_TXB1D60_SIZE                      equ 0001h
TXB1D6_TXB1D60_LENGTH                    equ 0001h
TXB1D6_TXB1D60_MASK                      equ 0001h
TXB1D6_TXB1D61_POSN                      equ 0001h
TXB1D6_TXB1D61_POSITION                  equ 0001h
TXB1D6_TXB1D61_SIZE                      equ 0001h
TXB1D6_TXB1D61_LENGTH                    equ 0001h
TXB1D6_TXB1D61_MASK                      equ 0002h
TXB1D6_TXB1D62_POSN                      equ 0002h
TXB1D6_TXB1D62_POSITION                  equ 0002h
TXB1D6_TXB1D62_SIZE                      equ 0001h
TXB1D6_TXB1D62_LENGTH                    equ 0001h
TXB1D6_TXB1D62_MASK                      equ 0004h
TXB1D6_TXB1D63_POSN                      equ 0003h
TXB1D6_TXB1D63_POSITION                  equ 0003h
TXB1D6_TXB1D63_SIZE                      equ 0001h
TXB1D6_TXB1D63_LENGTH                    equ 0001h
TXB1D6_TXB1D63_MASK                      equ 0008h
TXB1D6_TXB1D64_POSN                      equ 0004h
TXB1D6_TXB1D64_POSITION                  equ 0004h
TXB1D6_TXB1D64_SIZE                      equ 0001h
TXB1D6_TXB1D64_LENGTH                    equ 0001h
TXB1D6_TXB1D64_MASK                      equ 0010h
TXB1D6_TXB1D65_POSN                      equ 0005h
TXB1D6_TXB1D65_POSITION                  equ 0005h
TXB1D6_TXB1D65_SIZE                      equ 0001h
TXB1D6_TXB1D65_LENGTH                    equ 0001h
TXB1D6_TXB1D65_MASK                      equ 0020h
TXB1D6_TXB1D66_POSN                      equ 0006h
TXB1D6_TXB1D66_POSITION                  equ 0006h
TXB1D6_TXB1D66_SIZE                      equ 0001h
TXB1D6_TXB1D66_LENGTH                    equ 0001h
TXB1D6_TXB1D66_MASK                      equ 0040h
TXB1D6_TXB1D67_POSN                      equ 0007h
TXB1D6_TXB1D67_POSITION                  equ 0007h
TXB1D6_TXB1D67_SIZE                      equ 0001h
TXB1D6_TXB1D67_LENGTH                    equ 0001h
TXB1D6_TXB1D67_MASK                      equ 0080h

