GopalSaraf/Practicals/PSDL/include/proc/pic18f4682.inc
#define RXF2EID14                        BANKMASK(RXF2EIDH), 6, b
#define RXF2EID15                        BANKMASK(RXF2EIDH), 7, b
#define RXF2EID16                        BANKMASK(RXF2SIDL), 0, b
#define RXF2EID17                        BANKMASK(RXF2SIDL), 1, b
#define RXF2EID2                         BANKMASK(RXF2EIDL), 2, b
#define RXF2EID3                         BANKMASK(RXF2EIDL), 3, b
#define RXF2EID4                         BANKMASK(RXF2EIDL), 4, b
#define RXF2EID5                         BANKMASK(RXF2EIDL), 5, b
#define RXF2EID6                         BANKMASK(RXF2EIDL), 6, b
#define RXF2EID7                         BANKMASK(RXF2EIDL), 7, b
#define RXF2EID8                         BANKMASK(RXF2EIDH), 0, b
#define RXF2EID9                         BANKMASK(RXF2EIDH), 1, b
#define RXF2EN                           BANKMASK(RXFCON0), 2, b
#define RXF2EXIDEN                       BANKMASK(RXF2SIDL), 3, b
#define RXF2SID0                         BANKMASK(RXF2SIDL), 5, b
#define RXF2SID1                         BANKMASK(RXF2SIDL), 6, b
#define RXF2SID10                        BANKMASK(RXF2SIDH), 7, b
#define RXF2SID2                         BANKMASK(RXF2SIDL), 7, b
#define RXF2SID3                         BANKMASK(RXF2SIDH), 0, b
#define RXF2SID4                         BANKMASK(RXF2SIDH), 1, b
#define RXF2SID5                         BANKMASK(RXF2SIDH), 2, b
#define RXF2SID6                         BANKMASK(RXF2SIDH), 3, b
#define RXF2SID7                         BANKMASK(RXF2SIDH), 4, b
#define RXF2SID8                         BANKMASK(RXF2SIDH), 5, b
#define RXF2SID9                         BANKMASK(RXF2SIDH), 6, b
#define RXF3EID0                         BANKMASK(RXF3EIDL), 0, b
#define RXF3EID1                         BANKMASK(RXF3EIDL), 1, b
#define RXF3EID10                        BANKMASK(RXF3EIDH), 2, b
#define RXF3EID11                        BANKMASK(RXF3EIDH), 3, b
#define RXF3EID12                        BANKMASK(RXF3EIDH), 4, b
#define RXF3EID13                        BANKMASK(RXF3EIDH), 5, b
#define RXF3EID14                        BANKMASK(RXF3EIDH), 6, b
#define RXF3EID15                        BANKMASK(RXF3EIDH), 7, b
#define RXF3EID16                        BANKMASK(RXF3SIDL), 0, b
#define RXF3EID17                        BANKMASK(RXF3SIDL), 1, b
#define RXF3EID2                         BANKMASK(RXF3EIDL), 2, b
#define RXF3EID3                         BANKMASK(RXF3EIDL), 3, b
#define RXF3EID4                         BANKMASK(RXF3EIDL), 4, b
#define RXF3EID5                         BANKMASK(RXF3EIDL), 5, b
#define RXF3EID6                         BANKMASK(RXF3EIDL), 6, b
#define RXF3EID7                         BANKMASK(RXF3EIDL), 7, b
#define RXF3EID8                         BANKMASK(RXF3EIDH), 0, b
#define RXF3EID9                         BANKMASK(RXF3EIDH), 1, b
#define RXF3EN                           BANKMASK(RXFCON0), 3, b
#define RXF3EXIDEN                       BANKMASK(RXF3SIDL), 3, b
#define RXF3SID0                         BANKMASK(RXF3SIDL), 5, b
#define RXF3SID1                         BANKMASK(RXF3SIDL), 6, b
#define RXF3SID10                        BANKMASK(RXF3SIDH), 7, b
#define RXF3SID2                         BANKMASK(RXF3SIDL), 7, b
#define RXF3SID3                         BANKMASK(RXF3SIDH), 0, b
#define RXF3SID4                         BANKMASK(RXF3SIDH), 1, b
#define RXF3SID5                         BANKMASK(RXF3SIDH), 2, b
#define RXF3SID6                         BANKMASK(RXF3SIDH), 3, b
#define RXF3SID7                         BANKMASK(RXF3SIDH), 4, b
#define RXF3SID8                         BANKMASK(RXF3SIDH), 5, b
#define RXF3SID9                         BANKMASK(RXF3SIDH), 6, b
#define RXF4EID0                         BANKMASK(RXF4EIDL), 0, b
#define RXF4EID1                         BANKMASK(RXF4EIDL), 1, b
#define RXF4EID10                        BANKMASK(RXF4EIDH), 2, b
#define RXF4EID11                        BANKMASK(RXF4EIDH), 3, b
#define RXF4EID12                        BANKMASK(RXF4EIDH), 4, b
#define RXF4EID13                        BANKMASK(RXF4EIDH), 5, b
#define RXF4EID14                        BANKMASK(RXF4EIDH), 6, b
#define RXF4EID15                        BANKMASK(RXF4EIDH), 7, b
#define RXF4EID16                        BANKMASK(RXF4SIDL), 0, b
#define RXF4EID17                        BANKMASK(RXF4SIDL), 1, b
#define RXF4EID2                         BANKMASK(RXF4EIDL), 2, b
#define RXF4EID3                         BANKMASK(RXF4EIDL), 3, b
#define RXF4EID4                         BANKMASK(RXF4EIDL), 4, b
#define RXF4EID5                         BANKMASK(RXF4EIDL), 5, b
#define RXF4EID6                         BANKMASK(RXF4EIDL), 6, b
#define RXF4EID7                         BANKMASK(RXF4EIDL), 7, b
#define RXF4EID8                         BANKMASK(RXF4EIDH), 0, b
#define RXF4EID9                         BANKMASK(RXF4EIDH), 1, b
#define RXF4EN                           BANKMASK(RXFCON0), 4, b
#define RXF4EXIDEN                       BANKMASK(RXF4SIDL), 3, b
#define RXF4SID0                         BANKMASK(RXF4SIDL), 5, b
#define RXF4SID1                         BANKMASK(RXF4SIDL), 6, b
#define RXF4SID10                        BANKMASK(RXF4SIDH), 7, b
#define RXF4SID2                         BANKMASK(RXF4SIDL), 7, b
#define RXF4SID3                         BANKMASK(RXF4SIDH), 0, b
#define RXF4SID4                         BANKMASK(RXF4SIDH), 1, b
#define RXF4SID5                         BANKMASK(RXF4SIDH), 2, b
#define RXF4SID6                         BANKMASK(RXF4SIDH), 3, b
#define RXF4SID7                         BANKMASK(RXF4SIDH), 4, b
#define RXF4SID8                         BANKMASK(RXF4SIDH), 5, b
#define RXF4SID9                         BANKMASK(RXF4SIDH), 6, b
#define RXF5EID0                         BANKMASK(RXF5EIDL), 0, b
#define RXF5EID1                         BANKMASK(RXF5EIDL), 1, b
#define RXF5EID10                        BANKMASK(RXF5EIDH), 2, b
#define RXF5EID11                        BANKMASK(RXF5EIDH), 3, b
#define RXF5EID12                        BANKMASK(RXF5EIDH), 4, b
#define RXF5EID13                        BANKMASK(RXF5EIDH), 5, b
#define RXF5EID14                        BANKMASK(RXF5EIDH), 6, b
#define RXF5EID15                        BANKMASK(RXF5EIDH), 7, b
#define RXF5EID16                        BANKMASK(RXF5SIDL), 0, b
#define RXF5EID17                        BANKMASK(RXF5SIDL), 1, b
#define RXF5EID2                         BANKMASK(RXF5EIDL), 2, b
#define RXF5EID3                         BANKMASK(RXF5EIDL), 3, b
#define RXF5EID4                         BANKMASK(RXF5EIDL), 4, b
#define RXF5EID5                         BANKMASK(RXF5EIDL), 5, b
#define RXF5EID6                         BANKMASK(RXF5EIDL), 6, b
#define RXF5EID7                         BANKMASK(RXF5EIDL), 7, b
#define RXF5EID8                         BANKMASK(RXF5EIDH), 0, b
#define RXF5EID9                         BANKMASK(RXF5EIDH), 1, b
#define RXF5EN                           BANKMASK(RXFCON0), 5, b
#define RXF5EXIDEN                       BANKMASK(RXF5SIDL), 3, b
#define RXF5SID0                         BANKMASK(RXF5SIDL), 5, b
#define RXF5SID1                         BANKMASK(RXF5SIDL), 6, b
#define RXF5SID10                        BANKMASK(RXF5SIDH), 7, b
#define RXF5SID2                         BANKMASK(RXF5SIDL), 7, b
#define RXF5SID3                         BANKMASK(RXF5SIDH), 0, b
#define RXF5SID4                         BANKMASK(RXF5SIDH), 1, b
#define RXF5SID5                         BANKMASK(RXF5SIDH), 2, b
#define RXF5SID6                         BANKMASK(RXF5SIDH), 3, b
#define RXF5SID7                         BANKMASK(RXF5SIDH), 4, b
#define RXF5SID8                         BANKMASK(RXF5SIDH), 5, b
#define RXF5SID9                         BANKMASK(RXF5SIDH), 6, b
#define RXF6EID0                         BANKMASK(RXF6EIDL), 0, b
#define RXF6EID1                         BANKMASK(RXF6EIDL), 1, b
#define RXF6EID10                        BANKMASK(RXF6EIDH), 2, b
#define RXF6EID11                        BANKMASK(RXF6EIDH), 3, b
#define RXF6EID12                        BANKMASK(RXF6EIDH), 4, b
#define RXF6EID13                        BANKMASK(RXF6EIDH), 5, b
#define RXF6EID14                        BANKMASK(RXF6EIDH), 6, b
#define RXF6EID15                        BANKMASK(RXF6EIDH), 7, b
#define RXF6EID16                        BANKMASK(RXF6SIDL), 0, b
#define RXF6EID17                        BANKMASK(RXF6SIDL), 1, b
#define RXF6EID2                         BANKMASK(RXF6EIDL), 2, b
#define RXF6EID3                         BANKMASK(RXF6EIDL), 3, b
#define RXF6EID4                         BANKMASK(RXF6EIDL), 4, b
#define RXF6EID5                         BANKMASK(RXF6EIDL), 5, b
#define RXF6EID6                         BANKMASK(RXF6EIDL), 6, b
#define RXF6EID7                         BANKMASK(RXF6EIDL), 7, b
#define RXF6EID8                         BANKMASK(RXF6EIDH), 0, b
#define RXF6EID9                         BANKMASK(RXF6EIDH), 1, b
#define RXF6EN                           BANKMASK(RXFCON0), 6, b
#define RXF6EXIDEN                       BANKMASK(RXF6SIDL), 3, b
#define RXF6SID0                         BANKMASK(RXF6SIDL), 5, b
#define RXF6SID1                         BANKMASK(RXF6SIDL), 6, b
#define RXF6SID10                        BANKMASK(RXF6SIDH), 7, b
#define RXF6SID2                         BANKMASK(RXF6SIDL), 7, b
#define RXF6SID3                         BANKMASK(RXF6SIDH), 0, b
#define RXF6SID4                         BANKMASK(RXF6SIDH), 1, b
#define RXF6SID5                         BANKMASK(RXF6SIDH), 2, b
#define RXF6SID6                         BANKMASK(RXF6SIDH), 3, b
#define RXF6SID7                         BANKMASK(RXF6SIDH), 4, b
#define RXF6SID8                         BANKMASK(RXF6SIDH), 5, b
#define RXF6SID9                         BANKMASK(RXF6SIDH), 6, b
#define RXF7EID0                         BANKMASK(RXF7EIDL), 0, b
#define RXF7EID1                         BANKMASK(RXF7EIDL), 1, b
#define RXF7EID10                        BANKMASK(RXF7EIDH), 2, b
#define RXF7EID11                        BANKMASK(RXF7EIDH), 3, b
#define RXF7EID12                        BANKMASK(RXF7EIDH), 4, b
#define RXF7EID13                        BANKMASK(RXF7EIDH), 5, b
#define RXF7EID14                        BANKMASK(RXF7EIDH), 6, b
#define RXF7EID15                        BANKMASK(RXF7EIDH), 7, b
#define RXF7EID16                        BANKMASK(RXF7SIDL), 0, b
#define RXF7EID17                        BANKMASK(RXF7SIDL), 1, b
#define RXF7EID2                         BANKMASK(RXF7EIDL), 2, b
#define RXF7EID3                         BANKMASK(RXF7EIDL), 3, b
#define RXF7EID4                         BANKMASK(RXF7EIDL), 4, b
#define RXF7EID5                         BANKMASK(RXF7EIDL), 5, b
#define RXF7EID6                         BANKMASK(RXF7EIDL), 6, b
#define RXF7EID7                         BANKMASK(RXF7EIDL), 7, b
#define RXF7EID8                         BANKMASK(RXF7EIDH), 0, b
#define RXF7EID9                         BANKMASK(RXF7EIDH), 1, b
#define RXF7EN                           BANKMASK(RXFCON0), 7, b
#define RXF7EXIDEN                       BANKMASK(RXF7SIDL), 3, b
#define RXF7SID0                         BANKMASK(RXF7SIDL), 5, b
#define RXF7SID1                         BANKMASK(RXF7SIDL), 6, b
#define RXF7SID10                        BANKMASK(RXF7SIDH), 7, b
#define RXF7SID2                         BANKMASK(RXF7SIDL), 7, b
#define RXF7SID3                         BANKMASK(RXF7SIDH), 0, b
#define RXF7SID4                         BANKMASK(RXF7SIDH), 1, b
#define RXF7SID5                         BANKMASK(RXF7SIDH), 2, b
#define RXF7SID6                         BANKMASK(RXF7SIDH), 3, b
#define RXF7SID7                         BANKMASK(RXF7SIDH), 4, b
#define RXF7SID8                         BANKMASK(RXF7SIDH), 5, b
#define RXF7SID9                         BANKMASK(RXF7SIDH), 6, b
#define RXF8EID0                         BANKMASK(RXF8EIDL), 0, b
#define RXF8EID1                         BANKMASK(RXF8EIDL), 1, b
#define RXF8EID10                        BANKMASK(RXF8EIDH), 2, b
#define RXF8EID11                        BANKMASK(RXF8EIDH), 3, b
#define RXF8EID12                        BANKMASK(RXF8EIDH), 4, b
#define RXF8EID13                        BANKMASK(RXF8EIDH), 5, b
#define RXF8EID14                        BANKMASK(RXF8EIDH), 6, b
#define RXF8EID15                        BANKMASK(RXF8EIDH), 7, b
#define RXF8EID16                        BANKMASK(RXF8SIDL), 0, b
#define RXF8EID17                        BANKMASK(RXF8SIDL), 1, b
#define RXF8EID2                         BANKMASK(RXF8EIDL), 2, b
#define RXF8EID3                         BANKMASK(RXF8EIDL), 3, b
#define RXF8EID4                         BANKMASK(RXF8EIDL), 4, b
#define RXF8EID5                         BANKMASK(RXF8EIDL), 5, b
#define RXF8EID6                         BANKMASK(RXF8EIDL), 6, b
#define RXF8EID7                         BANKMASK(RXF8EIDL), 7, b
#define RXF8EID8                         BANKMASK(RXF8EIDH), 0, b
#define RXF8EID9                         BANKMASK(RXF8EIDH), 1, b
#define RXF8EN                           BANKMASK(RXFCON1), 0, b
#define RXF8EXIDEN                       BANKMASK(RXF8SIDL), 3, b
#define RXF8SID0                         BANKMASK(RXF8SIDL), 5, b
#define RXF8SID1                         BANKMASK(RXF8SIDL), 6, b
#define RXF8SID10                        BANKMASK(RXF8SIDH), 7, b
#define RXF8SID2                         BANKMASK(RXF8SIDL), 7, b
#define RXF8SID3                         BANKMASK(RXF8SIDH), 0, b
#define RXF8SID4                         BANKMASK(RXF8SIDH), 1, b
#define RXF8SID5                         BANKMASK(RXF8SIDH), 2, b
#define RXF8SID6                         BANKMASK(RXF8SIDH), 3, b
#define RXF8SID7                         BANKMASK(RXF8SIDH), 4, b
#define RXF8SID8                         BANKMASK(RXF8SIDH), 5, b
#define RXF8SID9                         BANKMASK(RXF8SIDH), 6, b
#define RXF9EID0                         BANKMASK(RXF9EIDL), 0, b
#define RXF9EID1                         BANKMASK(RXF9EIDL), 1, b
#define RXF9EID10                        BANKMASK(RXF9EIDH), 2, b
#define RXF9EID11                        BANKMASK(RXF9EIDH), 3, b
#define RXF9EID12                        BANKMASK(RXF9EIDH), 4, b
#define RXF9EID13                        BANKMASK(RXF9EIDH), 5, b
#define RXF9EID14                        BANKMASK(RXF9EIDH), 6, b
#define RXF9EID15                        BANKMASK(RXF9EIDH), 7, b
#define RXF9EID16                        BANKMASK(RXF9SIDL), 0, b
#define RXF9EID17                        BANKMASK(RXF9SIDL), 1, b
#define RXF9EID2                         BANKMASK(RXF9EIDL), 2, b
#define RXF9EID3                         BANKMASK(RXF9EIDL), 3, b
#define RXF9EID4                         BANKMASK(RXF9EIDL), 4, b
#define RXF9EID5                         BANKMASK(RXF9EIDL), 5, b
#define RXF9EID6                         BANKMASK(RXF9EIDL), 6, b
#define RXF9EID7                         BANKMASK(RXF9EIDL), 7, b
#define RXF9EID8                         BANKMASK(RXF9EIDH), 0, b
#define RXF9EID9                         BANKMASK(RXF9EIDH), 1, b
#define RXF9EN                           BANKMASK(RXFCON1), 1, b
#define RXF9EXIDEN                       BANKMASK(RXF9SIDL), 3, b
#define RXF9SID0                         BANKMASK(RXF9SIDL), 5, b
#define RXF9SID1                         BANKMASK(RXF9SIDL), 6, b
#define RXF9SID10                        BANKMASK(RXF9SIDH), 7, b
#define RXF9SID2                         BANKMASK(RXF9SIDL), 7, b
#define RXF9SID3                         BANKMASK(RXF9SIDH), 0, b
#define RXF9SID4                         BANKMASK(RXF9SIDH), 1, b
#define RXF9SID5                         BANKMASK(RXF9SIDH), 2, b
#define RXF9SID6                         BANKMASK(RXF9SIDH), 3, b
#define RXF9SID7                         BANKMASK(RXF9SIDH), 4, b
#define RXF9SID8                         BANKMASK(RXF9SIDH), 5, b
#define RXF9SID9                         BANKMASK(RXF9SIDH), 6, b
#define RXM0EID0                         BANKMASK(RXM0EIDL), 0, b
#define RXM0EID1                         BANKMASK(RXM0EIDL), 1, b
#define RXM0EID10                        BANKMASK(RXM0EIDH), 2, b
#define RXM0EID11                        BANKMASK(RXM0EIDH), 3, b
#define RXM0EID12                        BANKMASK(RXM0EIDH), 4, b
#define RXM0EID13                        BANKMASK(RXM0EIDH), 5, b
#define RXM0EID14                        BANKMASK(RXM0EIDH), 6, b
#define RXM0EID15                        BANKMASK(RXM0EIDH), 7, b
#define RXM0EID16                        BANKMASK(RXM0SIDL), 0, b
#define RXM0EID17                        BANKMASK(RXM0SIDL), 1, b
#define RXM0EID2                         BANKMASK(RXM0EIDL), 2, b
#define RXM0EID3                         BANKMASK(RXM0EIDL), 3, b
#define RXM0EID4                         BANKMASK(RXM0EIDL), 4, b
#define RXM0EID5                         BANKMASK(RXM0EIDL), 5, b
#define RXM0EID6                         BANKMASK(RXM0EIDL), 6, b
#define RXM0EID7                         BANKMASK(RXM0EIDL), 7, b
#define RXM0EID8                         BANKMASK(RXM0EIDH), 0, b
#define RXM0EID9                         BANKMASK(RXM0EIDH), 1, b
#define RXM0EXIDM                        BANKMASK(RXM0SIDL), 3, b
#define RXM0SID0                         BANKMASK(RXM0SIDL), 5, b
#define RXM0SID1                         BANKMASK(RXM0SIDL), 6, b
#define RXM0SID10                        BANKMASK(RXM0SIDH), 7, b
#define RXM0SID2                         BANKMASK(RXM0SIDL), 7, b
#define RXM0SID3                         BANKMASK(RXM0SIDH), 0, b
#define RXM0SID4                         BANKMASK(RXM0SIDH), 1, b
#define RXM0SID5                         BANKMASK(RXM0SIDH), 2, b
#define RXM0SID6                         BANKMASK(RXM0SIDH), 3, b
#define RXM0SID7                         BANKMASK(RXM0SIDH), 4, b
#define RXM0SID8                         BANKMASK(RXM0SIDH), 5, b
#define RXM0SID9                         BANKMASK(RXM0SIDH), 6, b
#define RXM1EID0                         BANKMASK(RXM1EIDL), 0, b
#define RXM1EID1                         BANKMASK(RXM1EIDL), 1, b
#define RXM1EID10                        BANKMASK(RXM1EIDH), 2, b
#define RXM1EID11                        BANKMASK(RXM1EIDH), 3, b
#define RXM1EID12                        BANKMASK(RXM1EIDH), 4, b
#define RXM1EID13                        BANKMASK(RXM1EIDH), 5, b
#define RXM1EID14                        BANKMASK(RXM1EIDH), 6, b
#define RXM1EID15                        BANKMASK(RXM1EIDH), 7, b
#define RXM1EID16                        BANKMASK(RXM1SIDL), 0, b
#define RXM1EID17                        BANKMASK(RXM1SIDL), 1, b
#define RXM1EID2                         BANKMASK(RXM1EIDL), 2, b
#define RXM1EID3                         BANKMASK(RXM1EIDL), 3, b
#define RXM1EID4                         BANKMASK(RXM1EIDL), 4, b
#define RXM1EID5                         BANKMASK(RXM1EIDL), 5, b
#define RXM1EID6                         BANKMASK(RXM1EIDL), 6, b
#define RXM1EID7                         BANKMASK(RXM1EIDL), 7, b
#define RXM1EID8                         BANKMASK(RXM1EIDH), 0, b
#define RXM1EID9                         BANKMASK(RXM1EIDH), 1, b
#define RXM1EXIDEN                       BANKMASK(RXM1SIDL), 3, b
#define RXM1SID0                         BANKMASK(RXM1SIDL), 5, b
#define RXM1SID1                         BANKMASK(RXM1SIDL), 6, b
#define RXM1SID10                        BANKMASK(RXM1SIDH), 7, b
#define RXM1SID2                         BANKMASK(RXM1SIDL), 7, b
#define RXM1SID3                         BANKMASK(RXM1SIDH), 0, b
#define RXM1SID4                         BANKMASK(RXM1SIDH), 1, b
#define RXM1SID5                         BANKMASK(RXM1SIDH), 2, b
#define RXM1SID6                         BANKMASK(RXM1SIDH), 3, b
#define RXM1SID7                         BANKMASK(RXM1SIDH), 4, b
#define RXM1SID8                         BANKMASK(RXM1SIDH), 5, b
#define RXM1SID9                         BANKMASK(RXM1SIDH), 6, b
#define RXWARN                           BANKMASK(COMSTAT), 1, a
#define R_NOT_W                          BANKMASK(SSPSTAT), 2, a
#define R_W                              BANKMASK(SSPSTAT), 2, a
#define R_nW                             BANKMASK(SSPSTAT), 2, a
#define SAM                              BANKMASK(BRGCON2), 6, a
#define SBOREN                           BANKMASK(RCON), 6, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCKP                             BANKMASK(BAUDCON), 4, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SEG1PH0                          BANKMASK(BRGCON2), 3, a
#define SEG1PH1                          BANKMASK(BRGCON2), 4, a
#define SEG1PH2                          BANKMASK(BRGCON2), 5, a
#define SEG2PH0                          BANKMASK(BRGCON3), 0, a
#define SEG2PH1                          BANKMASK(BRGCON3), 1, a
#define SEG2PH2                          BANKMASK(BRGCON3), 2, a
#define SEG2PHT                          BANKMASK(BRGCON2), 7, a
#define SEG2PHTS                         BANKMASK(BRGCON2), 7, a
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SENDB                            BANKMASK(TXSTA), 3, a
#define SENDB1                           BANKMASK(TXSTA), 3, a
#define SJW0                             BANKMASK(BRGCON1), 6, a
#define SJW1                             BANKMASK(BRGCON1), 7, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN                             BANKMASK(RCSTA), 7, a
#define SREN                             BANKMASK(RCSTA), 5, a
#define SRENA                            BANKMASK(RCSTA), 5, a
#define SS                               BANKMASK(PORTA), 5, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC                             BANKMASK(TXSTA), 4, a
#define SYNC1                            BANKMASK(TXSTA), 4, a
